{
  "backend/main.mo": "Main backend actor implementing video platform with user profiles, videos, comments, playlists, subscriptions, reports, user suspensions, admin actions, and platform settings. Includes authorization and blob storage mixins with comprehensive CRUD operations and admin functions.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: admin login link in Layout.tsx header and admin login shortcut on HomePage.tsx, both with high confidence and mapped to test IDs REQ-29 and REQ-30.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, and hooks, describing the video platform UI with admin dashboard, moderation queue, video management, and user features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements including sidebar, charts, and semantic tokens.",
  "frontend/index.html": "HTML entry point for the VidStream application with root div and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main React app component configuring TanStack Router with routes for home, video, upload, profile, category, search, trending, history, playlist, and admin pages, wrapped in ThemeProvider with Layout and ProfileSetupModal.",
  "frontend/src/components/ActivityLogTable.tsx": "Admin activity log table component displaying timestamped admin actions with badges, popovers for details, and color-coded action types (ban, suspend, restore, etc.).",
  "frontend/src/components/AnalyticsChart.tsx": "Reusable chart component supporting line, area, and bar chart types using Recharts library with configurable data keys and responsive container.",
  "frontend/src/components/BulkActionDialog.tsx": "A confirmation dialog component for bulk video actions (remove, hide, feature) that displays warnings and executes mutations with toast notifications.",
  "frontend/src/components/CategoryNav.tsx": "A navigation component that renders a vertical list of predefined video categories (Gaming, Music, Education, etc.) as clickable links.",
  "frontend/src/components/CommentSection.tsx": "Displays video comments with add/delete functionality, showing user avatars, timestamps, and allowing authenticated users to post and delete their own comments.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header, mobile sheet menu, search bar, navigation links (Home, Trending, History, Profile, Admin), and displays unresolved report count badge for admins.",
  "frontend/src/components/LikeButton.tsx": "A button component that allows authenticated users to like videos once, displaying the like count and preventing duplicate likes with visual feedback.",
  "frontend/src/components/LoginButton.tsx": "Handles Internet Identity authentication with login/logout functionality, clearing query cache on logout and managing authentication state.",
  "frontend/src/components/ModerationQueue.tsx": "Displays reported videos with filtering by reason and sorting options (date/count), allowing admins to remove reported videos with session-persisted filter preferences.",
  "frontend/src/components/PlatformSettingsForm.tsx": "Admin form for configuring platform settings including max video size, allowed categories with bulk select/deselect, and moderation policies with change tracking and confirmation dialog.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup with fields for username, email, bio, and profile picture upload with progress tracking. Displays automatically when an authenticated user has no profile.",
  "frontend/src/components/ReportModal.tsx": "Modal dialog for reporting videos with predefined reasons (spam, inappropriate content, copyright, harassment, etc.) and optional additional details. Submits reports via useReportVideo hook.",
  "frontend/src/components/ReportVideoButton.tsx": "Button component that opens the ReportModal for authenticated users to report videos. Hidden for video owners and disabled after reporting.",
  "frontend/src/components/SettingsConfirmDialog.tsx": "Confirmation dialog for platform-wide settings changes, displaying a list of changes to review before applying via useUpdatePlatformSettings hook. Includes warning about immediate platform-wide effects.",
  "frontend/src/components/StatsCard.tsx": "Reusable card component displaying a statistic with an icon, label, and value. Used for dashboard metrics display.",
  "frontend/src/components/SubscribeButton.tsx": "Button component for subscribing to channels, hidden for own channels and requiring authentication. Handles subscription via useSubscribeToChannel hook.",
  "frontend/src/components/UserActionDialog.tsx": "Modal dialog for admin actions (suspend, ban, restore) on user accounts with reason input for suspend/ban actions. Includes warnings and confirmation before executing actions.",
  "frontend/src/components/UserManagementTable.tsx": "Admin table component for managing users with search functionality, pagination, and displays user profiles with statistics. Integrates UserActionDialog for suspend/ban/restore actions.",
  "frontend/src/components/VideoCard.tsx": "Card component displaying video thumbnail, title, description, category badge, and view count. Links to video watch page with hover effects.",
  "frontend/src/components/VideoManagementTable.tsx": "Admin component for managing videos with filtering by category/status, pagination, bulk selection, and actions (remove, hide, feature). Uses custom hooks for fetching trending videos and performing bulk operations.",
  "frontend/src/components/VideoPlayer.tsx": "Video player component that renders an HTML5 video element with controls, displaying a video file and optional thumbnail from the Video object.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling authentication with Internet Identity and initializing admin access control. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality using DFINITY's AuthClient. Manages identity state, login status, and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend operations including user profiles, videos (CRUD, search, trending), likes, comments, reports, admin actions, and platform settings. Each hook uses the actor from useActor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for theming (colors, spacing, borders) in both light and dark modes, plus base styles for typography using Inter font.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the root DOM element.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page with tabs for overview (stats and charts), user management, video management, moderation queue, activity logs, and platform settings. Checks admin permissions before rendering.",
  "frontend/src/pages/CategoryPage.tsx": "Displays videos filtered by category from URL params, showing a grid of VideoCard components with loading skeletons and empty state handling.",
  "frontend/src/pages/HistoryPage.tsx": "Displays a placeholder watch history page that requires authentication via Internet Identity. Shows a coming soon message for the watch history feature.",
  "frontend/src/pages/HomePage.tsx": "Main landing page with a hero banner, admin dashboard link, and a grid of trending videos. Displays loading skeletons while fetching data.",
  "frontend/src/pages/PlaylistPage.tsx": "Displays a placeholder playlist page that requires authentication. Shows a coming soon message for the playlist feature.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page showing avatar, bio, video count, and tabs for videos and playlists. Includes edit profile button for own profile and subscribe button for others.",
  "frontend/src/pages/SearchResultsPage.tsx": "Displays search results in a grid layout based on query parameter 'q'. Shows loading skeletons and handles empty states.",
  "frontend/src/pages/TrendingPage.tsx": "Shows trending videos in a grid with numbered rankings. Uses loading skeletons and handles empty states.",
  "frontend/src/pages/UploadPage.tsx": "Video upload form requiring authentication, with fields for title, description, category, video file (MP4/MOV), and optional thumbnail. Includes upload progress tracking and uses ExternalBlob for file handling.",
  "frontend/src/pages/VideoPage.tsx": "Video watch page with player, metadata, like/share/report buttons, subscribe functionality, and related videos sidebar. Displays video description and comment section.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support. Includes functions to store, retrieve, and clear parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with CSS variables, container settings, custom fonts (Inter), border radius variables, shadows, and accordion animations. Includes plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document (v13) describing a comprehensive video streaming platform with features including user authentication, video upload/streaming, social interactions, search, playlists, admin dashboard, live streaming, AI features, and monetization. Outlines scalable microservices architecture with CDN, cloud hosting, and distributed systems."
}