{
  "backend/main.mo": "Main backend actor implementing video platform functionality including user profiles, video upload/management, likes, comments, subscriptions, playlists, reports, and admin controls with authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (authentication, profiles, video upload/streaming, likes, comments, subscriptions, playlists, search, admin) to their corresponding files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, React Query hooks, UI components (video player, comments, likes, reports), and pages (home, video, upload, profile, admin) with their key functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes using oklch color space, including sidebar, chart, and UI component tokens.",
  "frontend/index.html": "HTML entry point for the StreamHub application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes (home, video, upload, profile, category, search, trending, history, playlist, admin), ThemeProvider, Layout wrapper, and ProfileSetupModal.",
  "frontend/src/components/CategoryNav.tsx": "Navigation component rendering a list of predefined video categories (Gaming, Music, Education, etc.) as type-safe router links.",
  "frontend/src/components/CommentSection.tsx": "Comment interface component with textarea for adding comments, list display with author avatars and timestamps, and delete functionality for comment authors with authentication checks.",
  "frontend/src/components/Layout.tsx": "Main application layout component with sticky header, search bar, sidebar navigation, and category filtering. Includes mobile responsive menu and authentication-aware navigation links.",
  "frontend/src/components/LikeButton.tsx": "Button component for liking videos with optimistic UI updates, authentication checks, and duplicate like prevention.",
  "frontend/src/components/LoginButton.tsx": "Authentication toggle button that handles Internet Identity login/logout with loading states and query cache clearing.",
  "frontend/src/components/ModerationQueue.tsx": "Admin interface displaying reported videos with report details and actions to remove videos or dismiss reports.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile creation with username, email, bio, and profile picture upload with progress tracking.",
  "frontend/src/components/ReportModal.tsx": "Dialog component for reporting videos with predefined reason selection and optional additional details textarea.",
  "frontend/src/components/ReportVideoButton.tsx": "Button that opens the report modal for non-owner users, with authentication checks and duplicate report prevention.",
  "frontend/src/components/SubscribeButton.tsx": "Channel subscription button with authentication checks and duplicate subscription handling, hidden for own channels.",
  "frontend/src/components/VideoCard.tsx": "Thumbnail card component displaying video metadata (title, description, views, category) with hover effects and navigation link.",
  "frontend/src/components/VideoPlayer.tsx": "HTML5 video player component with controls, poster image, and automatic reload on video URL changes.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous actor instance for backend communication, invalidating dependent queries when the actor changes based on Internet Identity authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, videos (CRUD, trending, search, categories), likes, comments, subscriptions, reports, and admin functions with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a dark-themed design system including colors for UI components, charts, and sidebar elements using oklch color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin-only dashboard page displaying platform statistics (users, videos, reports) with tabs for moderation queue and user management, protected by admin role check.",
  "frontend/src/pages/CategoryPage.tsx": "Displays videos filtered by category from URL params, showing a grid of video cards with loading skeletons and empty state handling.",
  "frontend/src/pages/HistoryPage.tsx": "Watch history page that requires authentication and currently shows a placeholder for upcoming watch history feature.",
  "frontend/src/pages/HomePage.tsx": "Main landing page featuring a hero banner and grid of trending videos with loading states and empty state messaging.",
  "frontend/src/pages/PlaylistPage.tsx": "Playlist detail page that requires authentication and currently shows a placeholder for upcoming playlist feature.",
  "frontend/src/pages/ProfilePage.tsx": "Displays a user profile page with avatar, bio, video count, and subscriber count, showing either an edit button for own profile or a subscribe button for others. Includes tabs for videos and playlists, with a grid of the user's uploaded videos.",
  "frontend/src/pages/SearchResultsPage.tsx": "Renders search results page that displays videos matching a search query from URL parameters. Shows loading skeletons during fetch and empty states for no query or no results.",
  "frontend/src/pages/TrendingPage.tsx": "Displays trending videos in a grid with numbered badges indicating rank. Shows loading skeletons while fetching and an empty state if no videos exist.",
  "frontend/src/pages/UploadPage.tsx": "Provides a form for authenticated users to upload videos with title, description, category, video file (MP4/MOV), and optional thumbnail. Handles file validation, upload progress tracking, and navigation to the video page after successful upload.",
  "frontend/src/pages/VideoPage.tsx": "Displays a video player page with video details, like/share/report buttons, subscribe button, description, comment section, and related videos sidebar. Shows owner-specific controls when the current user owns the video.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support. Includes functions to get, store, retrieve, and clear parameters from URL and session.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, custom animations, font families, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project configuration defining a modern video streaming platform with comprehensive features including user management, video upload/streaming, social features, search, playlists, admin dashboard, live streaming, AI features, and monetization. Includes architectural notes for scalable microservices infrastructure with CDN integration, cloud hosting, and distributed caching."
}